In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df_financeiro = pd.read_excel('C:/Users/carlo/OneDrive - Kumon América do Sul/kumon/financeiro/fluxo_despesas.xlsx')

In [5]:
df_financeiro

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,NaN,NaN,2019-01-01,2019-02-01 00:00:00,2019-03-01 00:00:00,2019-04-01 00:00:00,2019-05-01 00:00:00,2019-06-01 00:00:00,2019-07-01 00:00:00,2019-08-01 00:00:00,2019-09-01 00:00:00,2019-10-01 00:00:00,2019-11-01 00:00:00,2019-12-01 00:00:00,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Publicidade,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Brindes,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Papelaria/informática,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
220,boleto kumon store,NaN,NaT,0,NaN,NaN,NaN,NaN,283,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
221,Publicidade,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
222,Anuncio Jornal,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
223,azul - agendado,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
224,verde- pago,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:

df_financeiro.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18'],
      dtype='object')

In [46]:
df_financeiro.loc[1, :]

Unnamed: 0     NaN
Unnamed: 1     NaN
Unnamed: 2     NaT
Unnamed: 3     NaN
Unnamed: 4     NaN
Unnamed: 5     NaN
Unnamed: 6     NaN
Unnamed: 7     NaN
Unnamed: 8     NaN
Unnamed: 9     NaN
Unnamed: 10    NaN
Unnamed: 11    NaN
Unnamed: 12    NaN
Unnamed: 13    NaN
Unnamed: 14    NaN
Unnamed: 15    NaN
Unnamed: 16    NaN
Unnamed: 17    NaN
Unnamed: 18    NaN
Name: 1, dtype: object

In [16]:
df_destino = pd.read_excel('C:/Users/carlo/OneDrive - Kumon América do Sul/kumon/financeiro/temp/teste_destino.xlsx')
df_origem = pd.read_excel('C:/Users/carlo/OneDrive - Kumon América do Sul/kumon/financeiro/temp/teste_origem.xlsx')

In [15]:
df_destino

    Unnamed: 0  mes1  mes2
0  informatica     1     1
1      aluguel     4     4

In [17]:
df_origem

    Unnamed: 0  mes1  mes2
0  informatica     1     1
1      aluguel     4     4

In [18]:
df_destino['mes1']

0    1
1    4
Name: mes1, dtype: int64

In [19]:
df_destino['mes1'] = df_origem['mes1']

In [21]:
df_destino

    Unnamed: 0  mes1  mes2
0  informatica     1     1
1      aluguel     4     4

In [25]:
#df_notas1.at[0,'2o Bimestre'] = 9.5
df_origem.columns

Index(['Unnamed: 0', 'mes1', 'mes2'], dtype='object')

In [26]:
df_origem.index

RangeIndex(start=0, stop=2, step=1)

In [27]:
df_origem.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  2 non-null      object
 1   mes1        2 non-null      int64
 2   mes2        2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [30]:
df_origem.mes1

0    1
1    4
Name: mes1, dtype: int64

In [32]:
df_origem.loc[0, 'mes1']
#df.loc[0, 'High']       #df.loc[linha, coluna]

1

In [33]:
#df_notas1.at[0,'2o Bimestre'] = 9.5
df_origem.at[0, 'mes1'] = 6
df_origem.at[0, 'mes2'] = 7

In [34]:
df_origem

    Unnamed: 0  mes1  mes2
0  informatica     6     7
1      aluguel     4     4

In [35]:
df_destino

    Unnamed: 0  mes1  mes2
0  informatica     1     1
1      aluguel     4     4